###################################################################

# Created by write_sdc on Wed Jul 23 00:14:18 2014

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clk]
set_driving_cell -lib_cell INVX1 [get_ports reset]
set_driving_cell -lib_cell INVX1 [get_ports {router_address[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {router_address[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {router_address[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {router_address[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[25]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[26]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[27]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[28]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[29]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[30]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[31]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[32]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[33]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[34]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[35]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[36]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[37]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[38]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[39]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[40]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[41]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[42]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[43]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[44]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[45]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[46]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[47]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[48]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[49]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[50]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[51]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[52]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[53]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[54]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[55]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[56]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[57]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[58]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[59]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[60]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[61]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[62]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[63]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[64]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[65]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[66]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[67]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[68]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[69]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[70]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[71]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[72]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[73]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[74]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[75]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[76]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[77]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[78]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[79]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[80]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[81]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[82]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[83]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[84]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[85]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[86]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[87]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[88]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[89]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[90]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[91]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[92]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[93]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[94]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[95]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[96]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[97]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[98]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[99]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[100]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[101]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[102]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[103]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[104]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[105]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[106]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[107]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[108]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[109]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[110]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[111]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[112]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[113]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[114]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[115]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[116]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[117]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[118]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[119]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[120]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[121]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[122]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[123]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[124]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[125]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[126]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[127]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[128]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[129]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[130]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[131]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[132]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[133]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[134]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[135]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[136]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[137]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[138]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[139]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[140]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[141]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[142]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[143]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[144]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[145]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[146]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[147]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[148]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[149]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[150]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[151]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[152]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[153]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[154]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[155]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[156]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[157]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[158]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[159]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[160]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[161]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[162]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[163]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[164]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[165]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[166]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[167]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[168]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[169]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[170]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[171]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[172]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[173]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[174]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[175]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[176]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[177]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[178]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[179]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[180]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[181]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[182]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[183]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[184]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[185]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[186]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[187]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[188]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[189]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[190]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[191]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[192]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[193]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[194]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[195]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[196]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[197]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[198]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[199]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[200]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[201]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[202]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[203]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[204]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[205]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[206]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[207]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[208]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[209]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[210]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[211]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[212]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[213]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[214]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[215]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[216]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[217]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[218]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[219]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[220]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[221]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[222]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[223]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[224]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[225]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[226]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[227]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[228]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[229]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[230]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[231]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[232]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[233]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[234]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[235]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[236]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[237]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[238]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[239]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[240]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[241]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[242]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[243]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[244]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[245]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[246]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[247]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[248]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[249]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[250]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[251]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[252]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[253]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[254]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[255]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[256]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[257]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[258]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[259]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[260]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[261]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[262]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[263]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[264]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[265]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[266]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[267]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[268]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[269]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[270]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[271]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[272]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[273]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[274]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[275]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[276]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[277]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[278]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[279]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[280]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[281]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[282]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[283]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[284]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[285]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[286]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[287]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[288]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[289]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[290]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[291]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[292]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[293]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[294]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[295]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[296]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[297]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[298]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[299]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[300]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[301]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[302]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[303]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[304]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[305]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[306]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[307]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[308]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[309]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[310]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[311]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[312]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[313]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[314]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[315]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[316]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[317]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[318]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[319]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[320]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[321]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[322]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[323]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[324]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[325]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[326]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[327]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[328]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[329]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[330]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[331]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[332]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[333]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[334]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[335]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[336]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[337]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[338]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[339]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[340]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[341]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[342]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[343]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[344]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[345]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[346]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[347]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[348]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[349]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[350]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[351]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[352]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[353]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[354]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[355]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[356]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[357]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[358]}]
set_driving_cell -lib_cell INVX1 [get_ports {channel_in_ip[359]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {memory_bank_grant_in[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {flow_ctrl_in_op[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {credit_for_shared_in[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {credit_for_shared_in[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {credit_for_shared_in[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {credit_for_shared_in[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {credit_for_shared_in[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {shared_vc_in[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {shared_vc_in[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {shared_vc_in[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {shared_vc_in[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {shared_vc_in[4]}]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_input_delay -clock clk  0.1  [get_ports reset]
set_input_delay -clock clk  0.1  [get_ports {router_address[0]}]
set_input_delay -clock clk  0.1  [get_ports {router_address[1]}]
set_input_delay -clock clk  0.1  [get_ports {router_address[2]}]
set_input_delay -clock clk  0.1  [get_ports {router_address[3]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[0]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[1]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[2]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[3]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[4]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[5]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[6]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[7]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[8]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[9]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[10]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[11]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[12]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[13]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[14]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[15]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[16]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[17]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[18]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[19]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[20]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[21]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[22]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[23]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[24]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[25]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[26]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[27]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[28]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[29]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[30]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[31]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[32]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[33]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[34]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[35]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[36]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[37]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[38]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[39]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[40]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[41]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[42]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[43]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[44]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[45]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[46]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[47]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[48]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[49]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[50]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[51]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[52]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[53]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[54]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[55]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[56]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[57]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[58]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[59]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[60]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[61]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[62]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[63]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[64]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[65]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[66]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[67]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[68]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[69]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[70]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[71]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[72]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[73]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[74]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[75]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[76]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[77]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[78]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[79]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[80]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[81]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[82]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[83]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[84]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[85]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[86]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[87]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[88]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[89]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[90]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[91]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[92]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[93]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[94]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[95]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[96]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[97]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[98]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[99]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[100]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[101]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[102]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[103]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[104]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[105]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[106]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[107]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[108]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[109]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[110]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[111]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[112]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[113]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[114]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[115]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[116]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[117]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[118]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[119]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[120]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[121]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[122]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[123]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[124]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[125]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[126]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[127]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[128]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[129]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[130]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[131]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[132]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[133]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[134]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[135]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[136]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[137]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[138]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[139]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[140]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[141]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[142]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[143]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[144]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[145]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[146]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[147]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[148]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[149]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[150]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[151]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[152]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[153]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[154]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[155]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[156]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[157]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[158]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[159]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[160]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[161]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[162]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[163]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[164]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[165]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[166]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[167]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[168]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[169]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[170]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[171]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[172]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[173]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[174]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[175]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[176]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[177]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[178]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[179]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[180]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[181]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[182]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[183]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[184]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[185]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[186]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[187]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[188]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[189]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[190]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[191]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[192]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[193]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[194]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[195]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[196]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[197]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[198]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[199]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[200]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[201]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[202]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[203]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[204]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[205]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[206]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[207]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[208]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[209]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[210]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[211]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[212]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[213]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[214]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[215]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[216]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[217]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[218]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[219]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[220]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[221]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[222]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[223]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[224]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[225]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[226]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[227]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[228]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[229]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[230]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[231]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[232]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[233]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[234]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[235]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[236]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[237]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[238]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[239]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[240]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[241]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[242]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[243]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[244]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[245]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[246]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[247]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[248]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[249]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[250]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[251]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[252]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[253]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[254]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[255]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[256]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[257]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[258]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[259]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[260]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[261]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[262]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[263]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[264]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[265]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[266]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[267]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[268]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[269]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[270]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[271]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[272]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[273]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[274]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[275]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[276]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[277]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[278]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[279]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[280]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[281]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[282]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[283]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[284]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[285]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[286]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[287]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[288]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[289]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[290]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[291]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[292]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[293]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[294]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[295]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[296]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[297]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[298]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[299]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[300]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[301]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[302]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[303]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[304]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[305]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[306]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[307]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[308]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[309]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[310]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[311]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[312]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[313]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[314]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[315]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[316]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[317]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[318]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[319]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[320]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[321]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[322]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[323]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[324]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[325]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[326]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[327]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[328]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[329]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[330]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[331]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[332]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[333]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[334]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[335]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[336]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[337]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[338]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[339]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[340]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[341]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[342]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[343]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[344]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[345]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[346]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[347]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[348]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[349]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[350]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[351]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[352]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[353]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[354]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[355]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[356]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[357]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[358]}]
set_input_delay -clock clk  0.1  [get_ports {channel_in_ip[359]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[0]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[1]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[2]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[3]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[4]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[5]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[6]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[7]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[8]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[9]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[10]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[11]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[12]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[13]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[14]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[15]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[16]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[17]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[18]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[19]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[20]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[21]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[22]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[23]}]
set_input_delay -clock clk  0.1  [get_ports {memory_bank_grant_in[24]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[0]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[1]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[2]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[3]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[4]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[5]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[6]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[7]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[8]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[9]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[10]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[11]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[12]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[13]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[14]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[15]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[16]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[17]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[18]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[19]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[20]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[21]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[22]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[23]}]
set_input_delay -clock clk  0.1  [get_ports {flow_ctrl_in_op[24]}]
set_input_delay -clock clk  0.1  [get_ports {credit_for_shared_in[0]}]
set_input_delay -clock clk  0.1  [get_ports {credit_for_shared_in[1]}]
set_input_delay -clock clk  0.1  [get_ports {credit_for_shared_in[2]}]
set_input_delay -clock clk  0.1  [get_ports {credit_for_shared_in[3]}]
set_input_delay -clock clk  0.1  [get_ports {credit_for_shared_in[4]}]
set_input_delay -clock clk  0.1  [get_ports {shared_vc_in[0]}]
set_input_delay -clock clk  0.1  [get_ports {shared_vc_in[1]}]
set_input_delay -clock clk  0.1  [get_ports {shared_vc_in[2]}]
set_input_delay -clock clk  0.1  [get_ports {shared_vc_in[3]}]
set_input_delay -clock clk  0.1  [get_ports {shared_vc_in[4]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[0]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[1]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[2]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[3]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[4]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[5]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[6]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[7]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[8]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[9]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[10]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[11]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[12]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[13]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[14]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[15]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[16]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[17]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[18]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[19]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[20]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[21]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[22]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[23]}]
set_output_delay -clock clk  0.1  [get_ports {flow_ctrl_out_ip[24]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[0]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[1]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[2]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[3]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[4]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[5]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[6]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[7]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[8]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[9]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[10]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[11]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[12]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[13]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[14]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[15]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[16]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[17]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[18]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[19]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[20]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[21]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[22]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[23]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[24]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[25]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[26]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[27]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[28]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[29]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[30]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[31]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[32]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[33]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[34]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[35]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[36]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[37]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[38]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[39]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[40]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[41]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[42]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[43]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[44]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[45]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[46]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[47]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[48]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[49]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[50]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[51]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[52]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[53]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[54]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[55]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[56]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[57]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[58]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[59]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[60]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[61]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[62]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[63]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[64]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[65]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[66]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[67]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[68]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[69]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[70]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[71]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[72]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[73]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[74]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[75]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[76]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[77]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[78]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[79]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[80]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[81]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[82]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[83]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[84]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[85]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[86]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[87]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[88]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[89]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[90]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[91]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[92]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[93]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[94]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[95]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[96]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[97]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[98]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[99]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[100]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[101]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[102]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[103]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[104]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[105]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[106]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[107]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[108]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[109]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[110]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[111]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[112]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[113]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[114]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[115]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[116]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[117]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[118]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[119]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[120]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[121]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[122]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[123]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[124]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[125]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[126]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[127]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[128]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[129]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[130]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[131]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[132]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[133]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[134]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[135]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[136]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[137]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[138]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[139]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[140]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[141]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[142]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[143]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[144]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[145]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[146]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[147]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[148]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[149]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[150]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[151]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[152]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[153]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[154]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[155]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[156]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[157]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[158]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[159]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[160]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[161]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[162]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[163]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[164]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[165]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[166]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[167]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[168]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[169]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[170]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[171]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[172]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[173]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[174]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[175]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[176]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[177]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[178]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[179]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[180]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[181]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[182]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[183]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[184]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[185]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[186]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[187]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[188]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[189]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[190]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[191]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[192]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[193]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[194]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[195]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[196]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[197]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[198]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[199]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[200]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[201]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[202]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[203]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[204]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[205]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[206]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[207]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[208]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[209]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[210]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[211]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[212]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[213]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[214]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[215]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[216]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[217]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[218]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[219]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[220]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[221]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[222]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[223]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[224]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[225]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[226]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[227]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[228]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[229]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[230]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[231]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[232]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[233]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[234]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[235]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[236]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[237]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[238]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[239]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[240]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[241]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[242]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[243]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[244]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[245]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[246]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[247]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[248]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[249]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[250]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[251]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[252]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[253]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[254]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[255]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[256]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[257]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[258]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[259]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[260]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[261]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[262]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[263]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[264]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[265]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[266]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[267]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[268]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[269]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[270]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[271]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[272]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[273]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[274]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[275]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[276]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[277]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[278]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[279]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[280]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[281]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[282]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[283]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[284]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[285]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[286]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[287]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[288]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[289]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[290]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[291]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[292]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[293]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[294]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[295]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[296]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[297]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[298]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[299]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[300]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[301]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[302]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[303]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[304]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[305]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[306]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[307]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[308]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[309]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[310]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[311]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[312]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[313]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[314]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[315]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[316]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[317]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[318]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[319]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[320]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[321]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[322]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[323]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[324]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[325]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[326]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[327]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[328]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[329]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[330]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[331]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[332]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[333]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[334]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[335]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[336]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[337]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[338]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[339]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[340]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[341]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[342]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[343]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[344]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[345]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[346]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[347]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[348]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[349]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[350]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[351]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[352]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[353]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[354]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[355]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[356]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[357]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[358]}]
set_output_delay -clock clk  0.1  [get_ports {channel_out_op[359]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[0]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[1]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[2]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[3]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[4]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[5]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[6]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[7]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[8]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[9]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[10]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[11]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[12]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[13]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[14]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[15]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[16]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[17]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[18]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[19]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[20]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[21]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[22]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[23]}]
set_output_delay -clock clk  0.1  [get_ports {memory_bank_grant_out[24]}]
set_output_delay -clock clk  0.1  [get_ports {credit_for_shared_out[0]}]
set_output_delay -clock clk  0.1  [get_ports {credit_for_shared_out[1]}]
set_output_delay -clock clk  0.1  [get_ports {credit_for_shared_out[2]}]
set_output_delay -clock clk  0.1  [get_ports {credit_for_shared_out[3]}]
set_output_delay -clock clk  0.1  [get_ports {credit_for_shared_out[4]}]
set_output_delay -clock clk  0.1  [get_ports {shared_vc_out[0]}]
set_output_delay -clock clk  0.1  [get_ports {shared_vc_out[1]}]
set_output_delay -clock clk  0.1  [get_ports {shared_vc_out[2]}]
set_output_delay -clock clk  0.1  [get_ports {shared_vc_out[3]}]
set_output_delay -clock clk  0.1  [get_ports {shared_vc_out[4]}]
set_output_delay -clock clk  0.1  [get_ports error]
